SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
/**
 **************************************************
 *
 * @file        esp32SpiAt.cpp
 * @brief       Main source file for the ESP32 WiFi used with AT commands
 *              through SPI communication.
 *
 *
 * @copyright   GNU General Public License v3.0
 * @authors     Borna Biro for soldered.com
 ***************************************************/

// Include header file.
#include "esp32SpiAt.h"

// Flag for the handshake for the ESP32. Use SPI MODE0, MSBFIRST data transfet with approx. SPI clock rate of 20MHz.
static volatile bool _esp32HandshakePinFlag = false;

// SPI Settings for ESP32.
static SPISettings _esp32AtSpiSettings(20000000ULL, MSBFIRST, SPI_MODE0);

// ISR for the ESP32 handshake pin. This will be called automatically from the interrupt.
static void esp32HandshakeISR()
{
    _esp32HandshakePinFlag = true;
}

/**
 * @brief Construct a new Wi-Fi Class:: Wi Fi Class object
 *
 */
WiFiClass::WiFiClass()
{
    // Empty...for now.
}

void WiFiClass::hwSetup(SPIClass *_spiClass)
{
    // Copy the references.
    _spi = _spiClass;
}

/**
 * @brief   Initializes ESP32-C3 Module. It powers up the module, sets it to factory
 *          settings, initializes WiFi radio and disables storing settings in NVM.
 *
 * @param   bool _resetSettings
 *          Setting this to true will reset all setting stored in NVM of the ESP32.
 *          This is optional parameter and by default, this parameter is set to true,
 *          but it can be overdriven.
 * @return  bool
 *          True - Initialization ok, ESP32 is ready.
 *          False - Initialization failed.
 */
bool WiFiClass::init(bool _resetSettings)
{
    // Set the hardware level stuff first.
    // Initialize Arduino SPI Library.
    _spi->begin();

    // Set handshake pin.
    pinMode(INKPLATE_ESP32_HANDSHAKE_PIN, INPUT_PULLUP);

    // Set interrupt on handshake pin.
    attachInterrupt(digitalPinToInterrupt(INKPLATE_ESP32_HANDSHAKE_PIN), esp32HandshakeISR, RISING);

    // Set SPI CS Pin.
    pinMode(INKPLATE_ESP32_CS_PIN, OUTPUT);

    // Disable ESP32 SPI for now.
    digitalWrite(INKPLATE_ESP32_CS_PIN, HIGH);

    // Set ESP32 power switch pin.
    pinMode(INKPLATE_ESP32_PWR_SWITCH_PIN, OUTPUT);

    // Try to power on the modem. Return false if failed.
    if (!power(true, _resetSettings))
        return false;

    // If everything went ok, return true.
    return true;
}

/**
 * @brief   Power up or powers down the ESP32 module.
 *
 * @param   bool _en
 *          true - Enable the ESP32 module.
 *          false - Disables the ESP32 module.
 * @param   bool _resetSettings
 *          Setting this to true will reset all setting stored in NVM of the ESP32.
 *          This is optional parameter and by default, this parameter is set to true,
 *          but it can be overdriven.
 * @return  bool
 *          true - Modem is successfully powered up.
 *          false - Modem failed to power up.
 */
bool WiFiClass::power(bool _en, bool _resetSettings)
{
    if (_en)
    {
        // Enable the power to the ESP32.
        digitalWrite(INKPLATE_ESP32_PWR_SWITCH_PIN, HIGH);

        // Wait a little bit for the ESP32 to boot up.
        delay(50);

        // Wait for the EPS32 to be ready. It will send a handshake to notify master
        // To read the data - "\r\nready\r\n" packet. Since the handshake pin pulled high
        // with the external resistor, we need to wait for the handshake pin to go low first,
        // then wait for the proper handshake event.
        if (!isModemReady())
            return false;

        // Try to ping modem. Return fail if failed.
        if (!modemPing())
            return false;

        // Set ESP32 to its factory settings if needed.
        if (_resetSettings)
        {
            if (!systemRestore())
                return false;
        }

        // Disable echo on command. Return false if failed.
        if (!commandEcho(false))
            return false;

        // Enable default message filters.
        if (!defaultMsgFiltersEn())
            return false;

        // Disable stroing data in NVM. Return false if failed.
        if (!storeSettingsInNVM(false))
            return false;

        // Disable system messages. Can disrupt flow of the library.
        if (!systemMessages(0))
            return false;

        // Initialize WiFi radio.
        if (!wiFiModemInit(true))
            return false;
    }
    else
    {
        // Disable the power to the ESP32.
        digitalWrite(INKPLATE_ESP32_PWR_SWITCH_PIN, LOW);

        // Wait a little bit for the ESP32 to power down.
        delay(50);
    }

    // Everything went ok? Return true.
    return true;
}

/**
 * @brief   Methods sends AT command to the modem. It check if the modem is ready to accept the command or not.
 *
 * @param   char *_atCommand
 *          AT commnds that will be sent to the modem.
 * @param   uint16_t _len
 *          If the array is not null terminated, you can set the length parameter.
 *          This parameter is optional. If not set, array will be treated like nul terminated char array.
 * @return  bool
 *          true - AT Command is successfully sent.
 *          false - AT Command send failed (modem not ready to accept the command).
 * @note    AT Command needs to have CRLF at the and. method won't at it at the end of the command.
 */
bool WiFiClass::sendAtCommand(char *_atCommand, uint16_t _len)
{
    // Flush ESP32 from data read request if needed and if this is enabled, since
    // this can block EPS32 from receving new AT commands.
    flushModemReadReq();

    // Get the data size. Use lenght parameter if array is not a nul-terminated string.
    uint16_t _dataLen = _len != 0 ? _len : strlen(_atCommand);

    // First make a request for data send.
    dataSendRequest(_dataLen, 0);

    // Read the slave status.
    uint16_t _statusLen = 0;
    uint8_t _slaveStatus = requestSlaveStatus(&_statusLen);

    // READABLE and WRITEABLE are independent bits, not a mutually exclusive enum - the ESP32
    // can present both at once (e.g. inbound UDP data arrived right as it became ready for the
    // next send). Drain any pending read first so the ESP32 SPI-AT state machine doesn't stay
    // stuck expecting a read the host never issued - that leaves handshake HIGH with no further
    // rising edge, hanging every future transaction.
    if (_slaveStatus & INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE)
    {
        if (_statusLen > 0)
        {
            dataRead(_dataBuffer, _statusLen);
            dataReadEnd();
        }
        _esp32HandshakePinFlag = false;
    }

    // Must also be WRITEABLE to proceed with the send.
    if (!(_slaveStatus & INKPLATE_ESP32_SPI_SLAVE_STATUS_WRITEABLE))
        return false;

    // Send the data.
    dataSend(_atCommand, _dataLen);

    // Send data end.
    dataSendEnd();

