SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    return true;
}

/**
 * @brief   Methods waits the response from the ESP32. It check if the modem is
 *          requesting the data read from slave. After it received request,
 *          timeout triggers if the new data is not available after timeout value.
 *          Timeout time is measured after the last received packet or char.
 *
 * @param   char *_response
 *          Buffer where to store response.
 * @param   uint32_t _bufferLen
 *          length of the buffer for the response (in bytes, counting the null-terminating char).
 * @param   unsigned long _timeout
 *          Timeout value from the last received char or packet in milliseconds.
 * @return  bool
 *          true - Response has been received (no error handle for now).
 */
bool WiFiClass::getAtResponse(char *_response, uint32_t _bufferLen, unsigned long _timeout, uint16_t *_rxLen)
{
    // Timeout variable.
    unsigned long _timeoutCounter = 0;

    // Variable for the response array index offset.
    uint32_t _resposeArrayOffset = 0;

    // Capture the time!
    _timeoutCounter = millis();

    // Now loop until the timeout occurs
    while ((unsigned long)(millis() - _timeoutCounter) < _timeout)
    {
        // Wait for the response by checking the handshake pin.
        if (_esp32HandshakePinFlag)
        {
            // Read the slave status.
            uint16_t _responseLen = 0;
            uint8_t _slaveStatus = requestSlaveStatus(&_responseLen);

            // READABLE and WRITEABLE are independent bits and can both be set at once - test with
            // a bitwise check, not equality, or a simultaneous WRITEABLE indication makes this
            // silently skip draining the pending data.
            if (_slaveStatus & INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE)
            {
                // Update the timeout!
                _timeoutCounter = millis();

                // Check if there is enough free memory in the buffer. If there is still free memory,
                // get the response. Otherwise, drop everything.
                if ((_responseLen + _resposeArrayOffset) < _bufferLen)
                {
                    // Read the data.
                    dataRead((_response + _resposeArrayOffset), _responseLen);

                    // Move the index in response array.
                    _resposeArrayOffset += _responseLen;
                }

                // Send read done.
                dataReadEnd();

                // Clear the flag.
                _esp32HandshakePinFlag = false;
            }
        }
    }

    // Add null-terminating char.
    _response[_resposeArrayOffset] = '\0';

    // If poiter is provided, pass number of received bytes.
    if (_rxLen != NULL)
        *_rxLen = _resposeArrayOffset;

    // Check if any data is received. If not, return false.
    return (_resposeArrayOffset != 0 ? true : false);
}

/**
 * @brief   Wait for the reponse form the modem. Method check if the modem is requesting a read from the
 *          master device. It will wait timeout value until for the response.
 *
 * @param   char *_response
 *          Buffer where to store response.
 * @param   uint32_t _bufferLen
 *          length of the buffer for the response (in bytes, counting the null-terminating char).
 * @param   unsigned long _timeout
 *          Timeout value until the packets start arriving.
 * @param   uint16_t *_rxLen
 *          Pointer to the variable ehere length of the receiveds data will be stored.
 * @return  bool
 *          true - Response has been received (no error handle for now).
 */
bool WiFiClass::getSimpleAtResponse(char *_response, uint32_t _bufferLen, unsigned long _timeout, uint16_t *_rxLen)
{
    // Timeout variable.
    unsigned long _timeoutCounter = 0;

    // Variable for the response string length.
    uint16_t _responseLen = 0;

    // Capture the time!
    _timeoutCounter = millis();

    // Now loop until the timeout occurs
    while (((unsigned long)(millis() - _timeoutCounter) < _timeout) && (!_esp32HandshakePinFlag))
        ;

    // If the timeout occured, return false.
    if (!_esp32HandshakePinFlag)
        return false;

    // Otherwise read the data.
    // Check the slave status, if must be INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE
    uint8_t _slaveStatus = requestSlaveStatus(&_responseLen);

    // READABLE and WRITEABLE are independent bits and can both be set at once - test with
    // a bitwise check, not equality.
    if (!(_slaveStatus & INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE))
        return false;

    // Check if the buffer is large enough for the data.
    // If not, drop everything.
    if (_responseLen < _bufferLen)
    {
        // Read the data.
        dataRead(_response, _responseLen);
    }

    // Clear handshake pin.
    _esp32HandshakePinFlag = false;

    // Send read done.
    dataReadEnd();

    // Add null-terminating char if needed.
    if (_rxLen == NULL)
    {
        _response[_responseLen] = '\0';
    }
    else
    {
        *_rxLen = _responseLen;
    }

    // Check if any data is received. If not, return false.
    return (_responseLen != 0 ? true : false);
}

bool WiFiClass::sendAtCommandWithResponse(char *_atCommand, unsigned long _timeoutAtCommand,
                                          unsigned long _rxDataTimeoutAtCommand, char *_expectedResponseAtCmd,
                                          uint8_t _expectedResponsePosition, bool _terminateOnAtResponseError,
                                          char *_dataPart, uint16_t _dataPartLen, unsigned long _timeoutDataPart,
                                          char *_expectedResponseData, uint16_t *_len)
{
    // Return value.
    bool _retValue = false;

    // Variable to store response length from ESP32.
    uint16_t _respLen = 0;

    // Check if the _atCommand id not null. Is it is, then do not send the command.
    if (_atCommand != NULL)
    {
        // Send AT Command! If send failed (ESP32 SPI status == readable), return false.
        if (!sendAtCommand(_atCommand))
            return false;
    }

