SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    // If the timeout is not zero, get the respose. If there is no any kind of response in preddefined time (timeout)
    // return false (maybe flush will needed before new AT Command send, but that feature can be activated within the
    // libary).
    if (_timeoutAtCommand != 0)
    {
        // First wait for the any kind of response by using HANDSHAKE pin.
        unsigned long _timeoutCounter = millis();
        while (((unsigned long)(millis() - _timeoutCounter) <= _timeoutAtCommand) && (!getHandshakePinState()))
            ;

        // If there is no handshake pin activity, timeout occured, return false.
        if (!getHandshakePinState())
            return false;

        // If something is received, read the response.
        if (!getAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, _rxDataTimeoutAtCommand, &_respLen))
            return false;

        // Try to parse if expected response exists.
        if (_expectedResponseAtCmd != NULL)
        {
            // Add null terminating char at the end (needed for string manipulating functions).
            _dataBuffer[_respLen] = '\0';

            // Calculate the position of start of the buffer.
            char *_bufferStart = NULL;
            switch (_expectedResponsePosition)
            {
            case INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START:
                _bufferStart = _dataBuffer;
                break;
            case INKPLATE_ESP32_AT_EXPECTED_RESPONSE_ANY:
                _bufferStart = _dataBuffer;
                break;
            case INKPLATE_ESP32_AT_EXPECTED_RESPONSE_END:
                _bufferStart = _dataBuffer + _respLen - strlen(_expectedResponseAtCmd) - 5;
                break;
            default:
                _bufferStart = _dataBuffer;
            }

            // Save the first match occurance position.
            char *_responseMatch = strstr(_dataBuffer, _expectedResponseAtCmd);

            // If substring function returns NULL, match is not found.
            if (strstr(_dataBuffer, _expectedResponseAtCmd) == NULL)
            {
                // If flag for termination on unexpected response is set, return from the function.
                if (_terminateOnAtResponseError)
                    return false;
            }
            else
            {
                // Ok, something is found. Check position in the case of the INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START.
                if ((_expectedResponsePosition == INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START) &&
                    ((_responseMatch - _bufferStart) > 5))
                {
                    // If flag for termination on unexpected response is set, return from the function.
                    if (_terminateOnAtResponseError)
                        return false;
                }

                // Heh, it this is so simple. Sometimes, modem can respond with the command but also with the OK or
                // ERROR after that command. It's ok if there is no reponse, but it there is response and it's not ok,
                // something is wrong!
                if (getSimpleAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 200ULL, &_respLen))
                    // Check of OK. If not found, it's an error.
                    _retValue = strstr(_dataBuffer, "\r\nOK\r\n") != NULL;
                else
                    // No additional OK/ERROR response arrived - that's fine, per comment above.
                    _retValue = true;
            }
        }
    }

    // Now the data part. Only if the _dataPart is not null.
    if (_dataPart != NULL)
    {
        // Check the _dataPartLen. If is zero, then _dataPart is string. Use strlen to get the lenght of the string.
        if (_dataPartLen == 0)
            _dataPartLen = strlen(_dataPart);

        // Send AT Command! If send failed (ESP32 SPI status == readable), return false.
        if (!sendAtCommand(_dataPart, _dataPartLen))
            return false;

        // If the timeout is not zero, get the respose. If there is no any kind of response in preddefined time
        // (timeout) return false (maybe flush will needed before new AT Command send, but that feature can be activated
        // within the libary).
        if (_timeoutDataPart)
        {
            // Ok, now wait for the response. This can be tricky since some commands sends additional OK after
            // successful AT command (ex. +ATXYZ\r\n [delay] \r\nOK\r\n).
            if (!getSimpleAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, _timeoutDataPart, &_respLen))
                return false;

            if (_expectedResponseData != NULL)
            {
                // Check for the expected response.
                if (strstr(_dataBuffer, _expectedResponseData) == NULL)
                    return false;

                // Ok, is something is found, check for additional OK/ERROR.
                if (getSimpleAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 200ULL, &_respLen))
                {
                    // Check of OK. If not found, return error.
                    if (strstr(_dataBuffer, "\r\nOK\r\n") == NULL)
                        _retValue = false;
                }
            }
            else
                // You got so far. Everything seems to went fine, so return true!
                _retValue = true;
        }
    }

    // In needed, copy response len.
    if (_len != NULL)
        *_len = _respLen;

    // Return success/fail flag.
    return _retValue;
}

/**
 * @brief   Send AT Command + Data part
 *
 * @param   char *_atCommand
 *          AT Command (must contain \r\n at the end).
 * @param   char *_dataPart
 *          Data part of the command (that needs to be sent after ">")
 * @param   uint16_t _dataPartLen
 *          Lenght of the data part (set 0 is _dataPart if null terminated string).
 * @param   unsigned long _timeout
 *          Timeout on response on AT Command after the data is sent in milliseconds.
 * @param   char *_expectedResponse
 *          response from the modem if the command and data successfully accepted. By default, this parameter is set to
 *          "\r\nOK\r\n".
 * @return  bool
 *          true - Command and data are accepted.
 *          false - Command or data failed.
 */
bool WiFiClass::sendDataPart(char *_atCommand, char *_dataPart, uint16_t _dataPartLen, unsigned long _timeout,
                             char *_expectedResponse)
{
    if (_dataPart != NULL)
    {
        // If lenght is 0, it means this is string.
        if (_dataPartLen == 0)
            _dataPartLen = strlen(_dataPart);

        // Not a empty data set or string.
        if (_dataPartLen > 0)
        {
            // Send AT Command!
            if (sendAtCommand(_atCommand))
                return false;
            // Get the resposne (should response with ">").
            if (getAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 20ULL))
                return false;
            // Check for the response.
            if (strstr(_dataBuffer, "\r\n>") == NULL)
                return false;
            // Send the client ID itself.
            if (sendAtCommand(_dataPart, _dataPartLen))
                return false;
            // Now wait for the proper AT response.
            if (getSimpleAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, _timeout))
                ;
            // Check for the "OK". If is missing from the response, return error.
            if (strstr(_dataBuffer, _expectedResponse) == NULL)
                return false;
        }
    }

    // Return true for success.
    return true;
}

bool WiFiClass::messageFilter(bool _enable, char *_headFilter, char *_tailFilter)
{
    // Return value.
    bool _retValue = false;

    // Check the each size of the filter.
    int _headFilterLen = 0;
    int _tailFilterLen = 0;

    if (_headFilter != NULL)
        _headFilterLen = strlen(_headFilter);
    if (_tailFilter != NULL)
        _tailFilterLen = strlen(_tailFilter);

    // Send AT Command for message filter. If the filter should be enabled, first parameter must be 1, otherwise if
    // needs to be removed set it to 2.
    sprintf(_dataBuffer, "AT+SYSMSGFILTERCFG=%d,%d,%d\r\n", _enable ? 1 : 2, _headFilterLen, _tailFilterLen);

    // Send AT Command! If send failed (ESP32 SPI status == readable), return false.
    if (!sendAtCommand(_dataBuffer))
        return false;

