SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    // Now wait for the response. It should send "\r\nOK\r\n\r\n>".
    if (!getSimpleAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 600ULL))
        return false;

    // Check for the response.
    char *_match = strstr(_dataBuffer, "\r\nOK\r\n\r\n>");

    // It must be at the start of the response.
    if (_match != NULL)
    {
        if ((_match - _dataBuffer) > 5)
            return false;
    }
    else
    {
        // No expected response is found, return false.
        return false;
    }

    // First try to send head if needed.
    if (_headFilter != NULL)
    {
        // If failed, return false.
        if (!sendAtCommand(_headFilter))
            return false;

        // Must be delay!
        delay(5);
    }

    // Now try to send tail if needed.
    if (_tailFilter != NULL)
    {
        // If failed, return false.
        if (!sendAtCommand(_tailFilter))
            return false;

        // No delay this time.
    }

    // Wait for the response. It should send "\r\nOK\r\n".
    if (!getSimpleAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 600ULL))
        return false;

    // Check for the response.
    _match = strstr(_dataBuffer, "\r\nOK\r\n");

    // Match must exits!
    if (_match != NULL)
        _retValue = true;

    // Return success flag.
    return _retValue;
}

/**
 * @brief   Method pings the modem (sends "AT" command and waits for AT OK).
 *
 * @return  bool
 *          true - Modem is available (received AT OK).
 *          false - Modem is not available.
 */
bool WiFiClass::modemPing()
{
    // Send "AT" AT Command for Modem Ping.
    sendAtCommand((char *)esp32AtPingCommand);

    // Wait for the response from the modem.
    if (!getAtResponse((char *)_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 20ULL))
        return false;

    // Check if AT\r\n\r\nOK\r\n\r\n is received.
    if (strcmp((char *)_dataBuffer, esp32AtPingResponse) != 0)
        return false;

    // If everything went ok, return true.
    return true;
}

/**
 * @brief   Methods sends AT command to set factory settings to the ESP32.
 *
 * @return  bool
 *          true - Modem restored settings to it's factory values.
 *          false - Modem failed to restore settings.
 */
bool WiFiClass::systemRestore()
{
    // Calling this command will set ESP32 to its factory settings.
    if (!sendAtCommand((char *)esp32AtCmdSystemRestore))
        return false;

    // ESP32 nonsense. Wait for 2 seconds after memory restore.
    // Using handshake doesn't work reliably since it fires multiple times.
    delay(2200);

    // Read a response to clear the flag.
    if (!getAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 40ULL))
        return false;

    // Everything went ok? Return true.
    return true;
}

/**
 * @brief   Enable or disable storing settings into ESP32 NVM. By default, while power up, it is
 *          disabled.
 *
 * @param   bool _store
 *          true - Store settings into ESP32 NVM.
 *          false - Do not store settings into NVM.
 * @return  bool
 *          true - Command executed successfully.
 *          false - Command failed.
 */
bool WiFiClass::storeSettingsInNVM(bool _store)
{
    // Disable or enable storing data in NVM. By default, storing is enabled, but at the ESP
    // start up is disabled.

    // Make a AT Command depending on the choice of storing settings in NVM.
    sprintf(_dataBuffer, "AT+SYSSTORE=%d\r\n", _store ? 1 : 0);

    // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
    if (!sendAtCommandWithResponse(_dataBuffer, 20ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Otherwise return true.
    return true;
}

/**
 * @brief   Get the pointer (address) of the buffer for the SPI data.
 *
 * @return  char*
 *          Pointer of the SPI buffer for ESP32 communication and commands.
 */
char *WiFiClass::getDataBuffer()
{
    // Return the main RX/TX buffer fopr SPI data.
    return _dataBuffer;
}

/**
 * @brief   Disable or enable system prompt messages. By default,
 *          they are all disabled since they interfere with the library.
 * @param   uint8_t _cfg
 *          Config for the system messages (see desc. of AT+SYSMSG)
 * @return  bool
 *          true - Command execution was successfull.
 *          false - Command set failed.
 */
bool WiFiClass::systemMessages(uint8_t _cfg)
{
    // Make AT command depending on the confing.
    sprintf(_dataBuffer, "AT+SYSMSG=%d\r\n", _cfg);

    // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
    if (!sendAtCommandWithResponse(_dataBuffer, 20ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Return true if everything is ok.
    return true;
}

/**
 * @brief   Method enables or disables flushing ESP32 from data read requests before
 *          AT Command send.
 *
 * @param   bool _en
 *          true - Flush the ESP32 before every AT Command send.
 *          false - Do not flush ESP32 from data read request before AT command send.
 */
void WiFiClass::flushBeforeCommand(bool _en)
{
    // Store the state of the setting internally.
    _flushEspBeforeCmdSend = _en;
}

bool WiFiClass::defaultMsgFiltersEn()
{
    // Enable message filter for the WiFi Connect.
    if (!messageFilter(true, "^WIFI CONNECTED\r\n", NULL))
        return false;

    // Enable message filter for the WiFi Disconnect.
    if (!messageFilter(true, "^WIFI DISCONNECT\r\n", NULL))
        return false;

    // Enable message filter for the WIFI GOT IP message.
    if (!messageFilter(true, "^WIFI GOT IP\r\n", NULL))
        return false;

    // Enable system message filters. Return false if failed.
    if (!systemMsgFiltering(true))
        return false;

    // If code got to here, everything seems ok, return true for success.
    return true;
}

bool WiFiClass::systemMsgFiltering(bool _en)
{
    // Create AT Command with sprintf.
    sprintf(_dataBuffer, "AT+SYSMSGFILTER=%d\r\n", _en ? 1 : 0);

