SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    // Send AT command and wait for the respose. If there is no expected response, return false;
    if (!sendAtCommandWithResponse(_dataBuffer, 200ULL, 5ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Otherwise return true.
    return true;
}

/**
 * @brief   Methods sets WiFi mode (null, station, SoftAP or station and SoftAP).
 *
 * @param   uint8_t _wifiMode
 *          Use preddifend macros (can be found in esp32SpiAtTypedefs.h)
 *          INKPLATE_WIFI_MODE_NULL - Null mode (modem disabled)
 *          INKPLATE_WIFI_MODE_STA - Station mode
 *          INKPLATE_WIFI_MODE_AP - Soft Access Point (not implemeted yet!)
 *          INKPLATE_WIFI_MODE_STA_AP - Both station and Soft Access Point (AP mode still not implemeted!).
 * @return  bool
 *          true - Mode set successfully on ESP32
 *          false - Mode set failed.
 */
bool WiFiClass::setMode(uint8_t _wifiMode)
{
    // Check for the proper mode.
    if ((_wifiMode > INKPLATE_WIFI_MODE_STA_AP))
        return false;

    // First disconnect from the current network.
    disconnect();

    // Create AT Command string depending on the mode.
    sprintf(_dataBuffer, "AT+CWMODE=%d\r\n", _wifiMode);

    // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
    if (!sendAtCommandWithResponse(_dataBuffer, 200ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Otherwise, return ok.
    return true;
}

/**
 * @brief   Connect to the access point.
 *
 * @param   char *_ssid
 *          Char array/pointer to the AP name name.
 * @param   char *_pass
 *          Char array/pointer to the AP password.
 * @return  bool
 *          true - Command execution was successfull.
 *          false -  Command execution failed.
 * @note    Max characters for password is limited to 63 chars and SSID is only limited to UTF-8 encoding.
 *          Try to avoid usage following chars: {"}, {,}, {\\}. If used, escape char must be added.
 */
bool WiFiClass::begin(char *_ssid, char *_pass)
{
    // Check for user mistake (null-pointer!).
    if ((_ssid == NULL) || (_pass == NULL))
        return false;

    // Create string for AT comamnd.
    sprintf(_dataBuffer, "AT+CWJAP=\"%s\",\"%s\"\r\n", _ssid, _pass);

    // Send AT command.
    if (!sendAtCommand(_dataBuffer))
        return false;

    // Set the flag for WiFi connection in progress.
    _wifiConnectionInProgres = true;

    // Return ture - no need to be here, just future proof.
    return true;
}

/**
 * @brief   Methods returns the status of the ESP32 WiFi connection the AP.
 *
 * @return  bool
 *          true - ESP32 is connected to the AP.
 *          false - ESP32 is not connected to the AP.
 */
bool WiFiClass::connected()
{
    // Check if the WiFi connection to the AP is currently in progress.
    if (_wifiConnectionInProgres)
    {
        // That means EPS32 will send WL CONNECTED message as soon as the connection with the AP
        // is established.
        if (getAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 100ULL))
        {
            // If you got something, check if is the message for the WiFi.
            if (strstr(_dataBuffer, esp32AtCmdResponseOK))
            {
                // OK, now we got access to the AP.
                _wifiConnectionInProgres = false;

                // Return true for succesfully connected to the AP.
                return true;
            }
        }
    }
    else
    {
        // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
        if (sendAtCommandWithResponse((char *)"AT+CWSTATE?\r\n", 200ULL, 4ULL,
                                      "+CWSTATE:", INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        {
            // Parse the data.
            int _result;
            if (sscanf(_dataBuffer, "+CWSTATE:%d", &_result) != 1)
                return false;

            // If the result is 2, that means it's connected to the WiFi and ESP32 got the IP address.
            if (_result == 2)
                return true;
        }
        else
        {
            return false;
        }
    }

    // No response? Return false.
    return false;
}
/**
 * @brief   Method executes command to the ESP32 to disconnects from the AP.
 *
 * @return  bool
 *          true - Command is executed successfully.
 *          false - Command failed.
 */
bool WiFiClass::disconnect()
{
    // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
    if (!sendAtCommandWithResponse((char *)esp32AtWiFiDisconnectCommand, 2000ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Otherwise, return ok.
    return true;
}

/**
 * @brief   Methods prompts ESP32 to run a WiFi network scan. Scan takes about 2 seconds.
 *
 * @return  int
 *          Number of available networks (including encrypted and hidden ones).
 */
int WiFiClass::scanNetworks()
{
    // Issue a WiFi Scan command and get the response. Check if the response is expected. Otherwise, return false.
    if (sendAtCommandWithResponse((char *)esp32AtWiFiScan, 2000ULL, 4ULL, (char *)("+CWLAP:"),
                                  INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
    {
        // Find first occurance of the first found network.
        char *_wifiAPStart = strstr(_dataBuffer, "+CWLAP:");

        // Parse how many networks have been found.
        while ((_wifiAPStart != NULL) && (_foundWiFiAp < INKPLATE_ESP32_MAX_SCAN_AP))
        {
            _startApindex[_foundWiFiAp] = _wifiAPStart - _dataBuffer;
            _foundWiFiAp++;
            _wifiAPStart = strstr(_wifiAPStart + 1, "+CWLAP:");
        }
    }
    else
    {
        // No reponse? Return 0 found neworks.
    }

    // Otherwise, if some networks werw found, return number of available networks.
    return _foundWiFiAp;
}

/**
 * @brief   Method gets SSID of a scaned network.
 *
 * @param   int _ssidNumber
 *          Network number on the found network list.
 * @return  char*
 *          SSID of the network.
 */
char *WiFiClass::ssid(int _ssidNumber)
{
    // Check if the parsing is successfull. If not, return empty string.
    if (!parseFoundNetworkData(_ssidNumber, &_lastUsedSsid, &_lastUsedSsidData))
        return "\0";

    // If parsing is successfull, return SSID name.
    return _lastUsedSsidData.ssidName;
}

/**
 * @brief   Method gets auth. status of the selected network after the scan.
 *
 * @param   int _ssidNumber
 *          Network number on the found network list.
 * @return  bool
 *          true - Network is encrypted.
 *          false - Network is open.
 */
bool WiFiClass::auth(int _ssidNumber)
{
    // Parse the found network data.
    parseFoundNetworkData(_ssidNumber, &_lastUsedSsid, &_lastUsedSsidData);

