SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    // If parsing is successfull, return auth status (false = open network, true = password locked".
    return _lastUsedSsidData.authType ? true : false;
}

/**
 * @brief   Method gets the RRIS value of the selected scaned networtk.
 *
 * @param   int _ssidNumber
 *          Network number on the found network list.
 * @return  int
 *          RSSI value in dBm of the selected network.
 */
int WiFiClass::rssi(int _ssidNumber)
{
    // Parse the found network data.
    parseFoundNetworkData(_ssidNumber, &_lastUsedSsid, &_lastUsedSsidData);

    // If parsing is successfull, return RSSI.
    return _lastUsedSsidData.rssi;
}

/**
 * @brief   Obtain a local IP.
 *
 * @return  IPAddress
 *          Returns the local IP with Arduino IPAddress class.
 */
IPAddress WiFiClass::localIP()
{
    return ipAddressParse("ip");
}

/**
 * @brief   Get a gateway IP Address.
 *
 * @return  IPAddress
 *          Returns the Gateway IP with Arduino IPAddress class.
 */
IPAddress WiFiClass::gatewayIP()
{
    return ipAddressParse("gateway");
}

/**
 * @brief   Get a network subnet mask.
 *
 * @return  IPAddress
 *          Returns the network subnet mask with Arduino IPAddress class.
 */
IPAddress WiFiClass::subnetMask()
{
    return ipAddressParse("netmask");
}

/**
 * @brief   Get the DNS of the primary or secondary DNS.
 *
 * @param   uint8_t i
 *          0 - Get the DNS IP Address of the primary DNS.
 *          1 - Get the DNS IP Address of the secondary DNS.
 * @return  IPAddress
 *          Returns the selected DNS IP Address with Arduino IPAddress class.
 */
IPAddress WiFiClass::dns(uint8_t i)
{
    // Filter out the selected DNS. It can only be three DNS IP Addreses.
    if (i > 2)
        return INADDR_NONE;

    // DNS IP addresses array.
    int _dnsIpAddresses[3][4];

    // Clear the array.
    memset(_dnsIpAddresses[0], 0, sizeof(int) * 4);
    memset(_dnsIpAddresses[1], 0, sizeof(int) * 4);
    memset(_dnsIpAddresses[2], 0, sizeof(int) * 4);

    // Flag if the static or dynamic IP is used on ESP32.
    int _dhcpFlag = 0;

    // Issue a AT Command for DNS. Return invalid IP address if failed.
    if (sendAtCommandWithResponse((char *)esp32AtGetDns, 200ULL, 4ULL, (char *)("+CIPDNS:"),
                                  INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
    {
        // Try to parse the data.
        char *_responseStart = strstr(_dataBuffer, "+CIPDNS:");

        // If not found, return invalid IP Address.
        if (_responseStart == NULL)
            INADDR_NONE;

        // Parse it!
        int _res =
            sscanf(_responseStart, "+CIPDNS:%d,\"%d.%d.%d.%d\",\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"", &_dhcpFlag,
                   &_dnsIpAddresses[0][0], &_dnsIpAddresses[0][1], &_dnsIpAddresses[0][2], &_dnsIpAddresses[0][3],
                   &_dnsIpAddresses[1][0], &_dnsIpAddresses[1][1], &_dnsIpAddresses[1][2], &_dnsIpAddresses[1][3],
                   &_dnsIpAddresses[2][0], &_dnsIpAddresses[2][1], &_dnsIpAddresses[2][2], &_dnsIpAddresses[2][3]);

        // Check if all is parsed correctly, it should find at least one DNS. If not, return invalid IP Address.
        if (_res < 4)
            return INADDR_NONE;
    }
    else
    {
        // Failed to send / get response? Return invalid IP Address.
        return INADDR_NONE;
    }

    // Return wanted DNS.
    return IPAddress(_dnsIpAddresses[i][0], _dnsIpAddresses[i][1], _dnsIpAddresses[i][2], _dnsIpAddresses[i][3]);
}

/**
 * @brief   Get the MAC address of the ESP32. It will be returned with char array
 *          ("aa:bb:cc:11:22:33").
 *
 * @return  char*
 *          MAC Address of the ESP32.
 * @note    Original MAC can be changed with WiFiClass::macAddress(char *_mac) method.
 */
char *WiFiClass::macAddress()
{
    // Send AT Command for getting AT Command from the module.
    if (sendAtCommandWithResponse((char *)esp32AtWiFiGetMac, 200ULL, 4ULL, (char *)("+CIPAPMAC:"),
                                  INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
    {
        // Try to parse it.
        char *_responseStart = strstr(_dataBuffer, "+CIPAPMAC:");

        // If proper response is not found, return with invalid MAC address.
        if (_responseStart == NULL)
            return _invalidMac;

        // Get the MAC address from the response.
        int _res = sscanf(_responseStart, "+CIPAPMAC:%[^\r\n]", _esp32MacAddress);

        // If parsing failed, return invalid MAC address.
        if (!_res)
            return _invalidMac;
    }
    else
    {
        // If command or response failed return invalid MAC address.
        return _invalidMac;
    }

    // Return parsed MAC address.
    return _esp32MacAddress;
}

/**
 * @brief   Method set the MAC address of the ESP32.
 *
 * @param   char *_mac
 *          Pointer to the char array of the new MAC address. String with the
 *          new MAC address must have "aa:bb:cc:dd:ee:ff" format.
 * @return  bool
 *          true - New MAC address is set.
 *          false - New MAC address set failed.
 * @note    MAC address only can be set if the WiFI mode is set to SoftAP mode.
 */
bool WiFiClass::macAddress(char *_mac)
{
    // Create a string for the new MAC address.
    sprintf(_dataBuffer, "AT+CIPAPMAC=\"%s\"\r\n", _mac);

    // Send AT commands and check for the expected response ("\r\nOK\r\n"). If sending AT command failed or there is no
    // response, return false indicating error.
    if (!sendAtCommandWithResponse(_dataBuffer, 200ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Otherwise return true.
    return true;
}

/**
 * @brief   Methods enables complete WiFi config. Set LocalIP, GatewayIP, Subnet Mask and DNS with one call.
 *          To keep original value of the one IP address, use INADDR_NONE as parameter.
 *
 * @param   IPAddress _staticIP
 *          Set the local IP Address. To keep the default one, use INADDR_NONE.
 * @param   IPAddress _gateway
 *          Set the gateway IP Address. To keep the default one, use INADDR_NONE.
 * @param   IPAddress _subnet
 *          Set the sunbet mask. To keep the default one, use INADDR_NONE.
 * @param   IPAddress _dns1
 *          Set the Primary DNS IP Address. To keep the default one, use INADDR_NONE.
 * @param   IPAddress _dns2
 *          Set the Secondary DNS IP Address. To keep the default one, use INADDR_NONE.
 * @return  bool
 *          true - New IP config is set.
 *          false - New IP config set failed.
 */
bool WiFiClass::config(IPAddress _staticIP, IPAddress _gateway, IPAddress _subnet, IPAddress _dns1, IPAddress _dns2)
{
    // First get the current settings since not all of above must be included.
    if (_staticIP == INADDR_NONE)
    {
        _staticIP = ipAddressParse("ip");
    }

    if (_gateway == INADDR_NONE)
    {
        _gateway = ipAddressParse("gateway");
    }

