SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    if (_subnet == INADDR_NONE)
    {
        _subnet = ipAddressParse("netmask");
    }

    if (_dns1 == INADDR_NONE)
    {
        _dns1 = dns(0);
    }

    if (_dns1 == INADDR_NONE)
    {
        _dns1 = dns(1);
    }

    // Now send modified data.
    // Check if anything with the IP config have been modified. If so, send new settings.
    if ((_staticIP != INADDR_NONE) || (_gateway != INADDR_NONE) || (_subnet != INADDR_NONE))
    {
        // Send the AT commands for the new IP config.
        sprintf(_dataBuffer, "AT+CIPSTA=\"%d.%d.%d.%d\",\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"\r\n", _staticIP[0],
                _staticIP[1], _staticIP[2], _staticIP[3], _gateway[0], _gateway[1], _gateway[2], _gateway[3],
                _subnet[0], _subnet[1], _subnet[2], _subnet[3]);

        // Send AT command, wait for the response.
        if (!sendAtCommandWithResponse(_dataBuffer, 200ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                       INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
            return false;
    }

    // Check the same thing, but for DNS.
    if ((_dns1 != INADDR_NONE) || (_dns2 != INADDR_NONE))
    {
        // Create AT command for the DNS settings.
        sprintf(_dataBuffer, "AT+CIPDNS=1,\"%d.%d.%d.%d\",\"%d.%d.%d.%d\"\r\n", _dns1[0], _dns1[1], _dns1[2], _dns1[3],
                _dns2[0], _dns2[1], _dns2[2], _dns2[3]);

        // Send AT command, wait for the response.
        if (!sendAtCommandWithResponse(_dataBuffer, 200ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                       INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
            return false;
    }

    // If the code got so far, everything went ok, return true for success.
    return true;
}

/**
 * @brief   Wait for the ESP32 handshake pin to trigger master request using digitalRead()
 *          (polling). This funciton is not used anymore.
 *
 * @param   uint32_t _timeoutValue
 *          Timeout value until the request from the ESP32 happens in milliseconds.
 * @param   _validState
 *          Is the trigger state for the handshake pin HIGH or LOW.
 * @return  bool
 *          true - Handshake pin trigger detected.
 *          false - Timeout, no handshake trigger detected.
 */
bool WiFiClass::waitForHandshakePin(uint32_t _timeoutValue, bool _validState)
{
    // Variable for the timeout. Also capture the current state.
    unsigned long _timeout = millis();

    // Read the current state of the handshake pin.
    bool _handshakePinState = digitalRead(INKPLATE_ESP32_HANDSHAKE_PIN);

    // Check if the handshake pin is already set.
    if (_handshakePinState == _validState)
        return true;

    // If not, wait for the valid pin state.
    do
    {
        // Read the new state of the pin.
        _handshakePinState = digitalRead(INKPLATE_ESP32_HANDSHAKE_PIN);

        // Wait a little bit.
        delay(1);
    } while (((unsigned long)(millis() - _timeout) < _timeoutValue) && (_handshakePinState != _validState));

    // Check the state of the timeout. If timeout occured, return false.
    if ((millis() - _timeout) >= _timeoutValue)
        return false;

    // Otherwise return true.
    return true;
}

bool WiFiClass::getHandshakePinState()
{
    return _esp32HandshakePinFlag;
}

/**
 * @brief   Wait for the ESP32 handshake pin to trigger master request using interrutps.
 *
 * @param   uint32_t _timeoutValue
 *          Timeout value until the request from the ESP32 happens in milliseconds.
 * @return  bool
 *          true - Handshake pin trigger detected.
 *          false - Timeout, no handshake trigger detected.
 */
bool WiFiClass::waitForHandshakePinInt(uint32_t _timeoutValue)
{
    // First, clear the flag status.
    _esp32HandshakePinFlag = false;

    // Variable for the timeout. Also capture the current state.
    unsigned long _timeout = millis();

    // Wait for the rising edge in Handshake pin.
    while (((unsigned long)(millis() - _timeout) < _timeoutValue) && (!_esp32HandshakePinFlag))
        ;

    // Clear the flag.
    _esp32HandshakePinFlag = false;

    // Check the state of the timeout. If timeout occured, return false.
    if ((millis() - _timeout) >= _timeoutValue)
        return false;

    // Otherwise return true.
    return true;
}

/**
 * @brief   Get ESP32 slave status. It is used right after the ESP32 sends handshake (ESP32 issues
 *          request from the master to read the data from the ESP32).
 *
 * @param   uint16_t _len
 *          Number of bytes requested waiting to be read by thje master from the ESP32.
 * @return  uint8_t
 *          Return slave status (INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE or
 *          INKPLATE_ESP32_SPI_SLAVE_STATUS_WRITEABLE).
 */
uint8_t WiFiClass::requestSlaveStatus(uint16_t *_len)
{
    // Make a union/struct for data part of the SPI Command.
    union spiAtCommandsSlaveStatusTypedef _slaveStatus;
    _slaveStatus.elements.status = 0;
    _slaveStatus.elements.sequence = 0;
    _slaveStatus.elements.length = 0;

    // SPI Command Packet.
    struct spiAtCommandTypedef _spiCommand = {
        .cmd = INKPLATE_ESP32_SPI_CMD_REQ_SLAVE_INFO,
        .addr = 0x04,
        .dummy = 0x00,
        .data = (uint8_t *)&(_slaveStatus.bytes),
    };

    uint32_t _spiPacketLen = sizeof(_slaveStatus.bytes);

    // Transfer the packet!
    transferSpiPacket(&_spiCommand, _spiPacketLen);

    // Save the length if possible.
    if (_len != NULL)
        *_len = _slaveStatus.elements.length;

    // Return the slave status.
    return _slaveStatus.elements.status;
}

/**
 * @brief   Send data to the ESP32 and at the same time receive new data from ESP32.
 *
 * @param   spiAtCommandTypedef *_spiPacket
 *          Pointer to the spiAtCommandTypedef to describe data packet.
 * @param   uint16_t _spiDataLen
 *          length of the data part only, excluding spiAtCommandTypedef (in bytes).
 */
void WiFiClass::transferSpiPacket(spiAtCommandTypedef *_spiPacket, uint16_t _spiDataLen)
{
    // Get the SPI STM32 HAL Typedef Handle.
    SPI_HandleTypeDef *_spiHandle = _spi->getHandle();

    // Activate ESP32 SPI lines by pulling CS pin to low.
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, GPIO_PIN_RESET);

