SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    // Send everything, but the data.
    _spi->beginTransaction(_esp32AtSpiSettings);
    _spi->transfer(_spiPacket->cmd);
    _spi->transfer(_spiPacket->addr);
    _spi->transfer(_spiPacket->dummy);

    // _spi->transfer(_spiPacket->data, _spiDataLen);
    HAL_SPI_TransmitReceive(_spiHandle, (uint8_t *)_spiPacket->data, (uint8_t *)_spiPacket->data, _spiDataLen,
                            HAL_MAX_DELAY);
    _spi->endTransaction();

    // Disable ESP32 SPI lines by pulling CS pin to high.
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, GPIO_PIN_SET);
}

/**
 * @brief   Method only sends SPI data to the ESP32.
 *
 * @param   spiAtCommandTypedef *_spiPacket
 *          Pointer to the spiAtCommandTypedef to describe data packet.
 * @param   uint16_t _spiDataLen
 *          length of the data part only, excluding spiAtCommandTypedef (in bytes).
 */
void WiFiClass::sendSpiPacket(spiAtCommandTypedef *_spiPacket, uint16_t _spiDataLen)
{
    // Get the SPI STM32 HAL Typedef Handle.
    SPI_HandleTypeDef *_spiHandle = _spi->getHandle();

    // Pack ESP32 SPI Packer Header data.
    uint8_t _esp32SpiHeader[] = {_spiPacket->cmd, _spiPacket->addr, _spiPacket->dummy};

    // Activate ESP32 SPI lines by pulling CS pin to low.
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, GPIO_PIN_RESET);

    // Send everything, but the data.
    _spi->beginTransaction(_esp32AtSpiSettings);
    HAL_SPI_Transmit(_spiHandle, _esp32SpiHeader, sizeof(_esp32SpiHeader) / sizeof(uint8_t), HAL_MAX_DELAY);

    // Send data.
    HAL_SPI_Transmit(_spiHandle, _spiPacket->data, _spiDataLen, HAL_MAX_DELAY);
    _spi->endTransaction();

    // Disable ESP32 SPI lines by pulling CS pin to high.
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, GPIO_PIN_SET);
}

bool WiFiClass::commandEcho(bool _en)
{
    // Turn the Echo on or off.
    sprintf(_dataBuffer, "ATE%d\r\n", _en ? 1 : 0);
    if (!sendAtCommand(_dataBuffer))
        return false;
    if (!getAtResponse(_dataBuffer, INKPLATE_ESP32_AT_CMD_BUFFER_SIZE, 20ULL))
        return false;

    // Otherwise return true.
    return true;
}

/**
 * @brief   Send data to the ESP32.
 *
 * @param   char *_dataBuffer
 *          Pointer to the data buffer.
 * @param   uint32_t _len
 *          length of the data (in bytes).
 * @return  bool
 *          true - Data sent successfully.
 */
bool WiFiClass::dataSend(char *_dataBuffer, uint32_t _len)
{
    // Before sending data:
    // 1. Make a request for data send
    // 2. Read and check slave status - It should return with INKPLATE_ESP32_SPI_SLAVE_STATUS_WRITEABLE.

    // Calculate the number of chunks to send, since the max is 4092 bytes.
    uint16_t _chunks = _len / INKPLATE_ESP32_SPI_MAX_MESAGE_DATA_BUFFER;
    uint16_t _lastChunk = _chunks ? _len % INKPLATE_ESP32_SPI_MAX_MESAGE_DATA_BUFFER : _len;

    // Address offset for the data packet.
    uint32_t _dataPacketAddrOffset = 0;

    // Create an data packet for data send.
    struct spiAtCommandTypedef _spiDataSend = {
        .cmd = INKPLATE_ESP32_SPI_CMD_MASTER_SEND, .addr = 0x00, .dummy = 0x00, .data = (uint8_t *)(_dataBuffer)};

    // Go trough the chunks.
    while (_chunks--)
    {
        // Calculate the chunk size.
        uint16_t _chunkSize = _chunks != 0 ? INKPLATE_ESP32_SPI_MAX_MESAGE_DATA_BUFFER : _lastChunk;

        // Transfer the data!
        sendSpiPacket(&_spiDataSend, _chunkSize);

        // Update the address position.
        _dataPacketAddrOffset += _chunkSize;

        // Update the SPI ESP32 packer header.
        _spiDataSend.data = (uint8_t *)(_dataBuffer + _chunkSize);

        // Data end cmd? Don't know...Needs to be checked!
    }

    // Write the last one chunk (or the only one if the _len < 4092).
    sendSpiPacket(&_spiDataSend, _lastChunk);

    // Return true for success.
    return true;
}

/**
 * @brief   Send command to the ESP32 indicating data send has ended.
 *
 * @return  bool
 *          true - Command send successfully.
 */
bool WiFiClass::dataSendEnd()
{
    // Create the structure for the ESP32 SPI.
    // Data field is not used here.
    struct spiAtCommandTypedef _spiDataSend = {.cmd = INKPLATE_ESP32_SPI_CMD_MASTER_SEND_DONE, .addr = 0, .dummy = 0};

    // Transfer the packet! The re is not data field this time, so it's size is zero.
    transferSpiPacket(&_spiDataSend, 0);

    // Return true for success.
    return true;
}

/**
 * @brief   Read the data requested by the ESP32 with handshake pin.
 *
 * @param   char *_dataBuffer
 *          Pointer to the data buffer (where to store received data).
 * @param   _len
 *          Number of bytes needed to be read from the ESP32 (get this data from the slave status).
 * @return  bool
 *          true - Data read ok.
 */
bool WiFiClass::dataRead(char *_dataBuffer, uint16_t _len)
{
    // Before reading the data:
    // 1. Make a request for data read.
    // 2. Read and check slave status - It should return with INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE.

    // Create an data packet for data send.
    struct spiAtCommandTypedef _spiDataSend = {
        .cmd = INKPLATE_ESP32_SPI_CMD_MASTER_READ_DATA, .addr = 0x00, .dummy = 0x00, .data = (uint8_t *)(_dataBuffer)};

    // Read the last one chunk (or the only one if the _len < 4092).
    transferSpiPacket(&_spiDataSend, _len);

    // Return true for success.
    return true;
}

/**
 * @brief   Send ESP32 that no more data will be read. Must be
 *          sent after data read.
 *
 * @return  bool
 *          true - Command sent successfully.
 */
bool WiFiClass::dataReadEnd()
{
    // Create the structure for the ESP32 SPI.
    // Data field is not used here.
    struct spiAtCommandTypedef _spiDataSend = {.cmd = INKPLATE_ESP32_SPI_CMD_MASTER_READ_DONE, .addr = 0, .dummy = 0};

    // Transfer the packet! The re is not data field this time, so it's size is zero.
    transferSpiPacket(&_spiDataSend, 0);

    // Return true for success.
    return true;
}

/**
 * @brief   Make a request to send data to the ESP32.
 *
 * @param   int _len
 * @param   _seqNumber
 *          Message sequnece number - Guess this is used if the message is chunked.
 * @return  bool
 *          true - Request sent successfully.
 */
bool WiFiClass::dataSendRequest(uint16_t _len, uint8_t _seqNumber)
{
    // Create the structure for the ESP32 SPI.
    // Data field data info field now (spiAtCommandDataInfoTypedef union).

    // First fill the spiAtCommandDataInfoTypedef union (aka. data info field in the data field).
    spiAtCommandDataInfoTypedef _dataInfo;
    _dataInfo.elements.magicNumber = INKPLATE_ESP32_SPI_DATA_INFO_MAGIC_NUM;
    _dataInfo.elements.sequence = _seqNumber;
    _dataInfo.elements.length = _len;

    struct spiAtCommandTypedef _spiDataSend = {
        .cmd = INKPLATE_ESP32_SPI_CMD_REQ_TO_SEND_DATA,
        .addr = 0,
        .dummy = 0,
        .data = (uint8_t *)&(_dataInfo.bytes),
    };

    // Transfer the packet! The re is not data field this time, so it's size is zero.
    transferSpiPacket(&_spiDataSend, sizeof(_dataInfo.bytes));

    // Wait for the handshake!
    bool _ret = waitForHandshakePinInt(50ULL);

