SolderedElectronics/Inkplate_Motion_Arduino_Library/src/system/wifi/esp32SpiAt.cpp
    // Return the success status. If timeout occured, data read req. has failed.
    return _ret;
}

/**
 * @brief   Method flushes all data from the ESP32 if needed and if this feature is
 *          enabled. Enable or disable can be done with flushBeforeCommand(bool _en).
 *          Additional check for this setting doesn't have to be done, since this is
 *          already done in the method.
 *
 * @return  bool
 *          true - Flush done (there was some kind of read data request from the ESP32).
 *          flase - No data read request from the ESP32 - flush did not happend.
 */
bool WiFiClass::flushModemReadReq()
{
    // Return value. Returns if the flush happen.
    bool _retValue = false;

    // Check if the flush is enabled at all.
    // If not, do nothing!
    if (_flushEspBeforeCmdSend)
    {
        // Now check the state of the handshake pin - if is set to high,
        // ESP32 expects data read - flush needed.
        if (_esp32HandshakePinFlag)
        {
            // Set return value to true since there is data to flush.
            _retValue = true;

            // How many bytes to read.
            uint16_t _len = 0;

            // Keep it flushing until there is no more read requests. Bitwise check - READABLE and
            // WRITEABLE are independent bits and can both be set at once.
            while (_esp32HandshakePinFlag && (requestSlaveStatus(&_len) & INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE))
            {
                // Clear the handshake flag.
                _esp32HandshakePinFlag = false;

                // We "totally read" all data from the ESP32.
                dataRead(_dataBuffer, _len);
                dataReadEnd();

                // Wait a little bit for new data.
                delay(5ULL);
            }
        }
    }

    // Return the status of the flush.
    return _retValue;
}

/**
 * @brief   Method waits for the ESP32 module to be ready after power up.
 *
 * @return  bool
 *          true - ESP32 module/modem is ready.
 *          false - ESP32 did not respond with "ready" message.
 * @note    Timeout for the reponse is 5 seconds.
 */
bool WiFiClass::isModemReady()
{
    if (waitForHandshakePinInt(5000ULL))
    {
        // Check for the request, since the Handshake pin is high.
        // Also get the data length.
        uint16_t _dataLen = 0;
        if (requestSlaveStatus(&_dataLen) & INKPLATE_ESP32_SPI_SLAVE_STATUS_READABLE)
        {
            // Ok, now try to read the data. First fill the ESP32 read packet
            dataRead(_dataBuffer, _dataLen);

            // Finish data read.
            dataReadEnd();

            // Parse the data!
            // Add null-terminating char at the end.
            _dataBuffer[_dataLen] = '\0';

            // Compare it. It should find "\r\nready\r\n".
            if (strcmp("\r\nready\r\n", (char *)_dataBuffer) != 0)
            {
                // Serial.println("modem ready parse error!");
                return false;
            }
        }
        else
        {
            // Serial.println("Wrong slave request");
            return false;
        }
    }
    else
    {
        // Serial.println("Handshake not detected");
        return false;
    }

    // Modem ready? Return true for success!
    return true;
}

/**
 * @brief   Method initializes or de-initializes WiFi radio.
 *
 * @param   bool _status
 *          true - Init WiFi radio.
 *          false - Disable WiFi radio.
 * @return  bool
 *          true - Command executed successfully.
 *          false - Command failed.
 */
bool WiFiClass::wiFiModemInit(bool _status)
{
    // Create a AT Commands String depending on the WiFi Initialization status.
    sprintf(_dataBuffer, "AT+CWINIT=%d\r\n", _status);

    // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
    if (!sendAtCommandWithResponse(_dataBuffer, 200ULL, 4ULL, (char *)esp32AtCmdResponseOK,
                                   INKPLATE_ESP32_AT_EXPECTED_RESPONSE_START, true, NULL, 0, 0, NULL))
        return false;

    // Otherwise return true.
    return true;
}

/**
 * @brief   Helper method for parsing scaned WiFi networks data.
 *
 * @param   int8_t _ssidNumber
 *          Requested scaned nwtwork ID number (internal ID number, not linked to the WiFi network in any way).
 * @param   int8_t *_lastUsedSsidNumber
 *          Pointer tothe variable that holds the last selected ID number.
 * @param   struct spiAtWiFiScanTypedef *_scanData
 *          Can be found in esp32SpiAtTypedefs.h, holds SSID name, auth flag, RSSI value.
 * @return  bool
 *          true - Scaned WiFi network data parsed successfully.
 *          false - Parsing failed.
 */
bool WiFiClass::parseFoundNetworkData(int8_t _ssidNumber, int8_t *_lastUsedSsidNumber,
                                      struct spiAtWiFiScanTypedef *_scanData)
{
    // Check if the last used SSID number matches current one. If so, do not need to parse anything.
    if (*_lastUsedSsidNumber == _ssidNumber)
        return true;

    // If not, check for the SSID number.
    if (_ssidNumber > _foundWiFiAp)
        return false;

    // Try to parse it!
    int _result = sscanf(_dataBuffer + _startApindex[_ssidNumber], "+CWLAP:(%d,\"%[^\",]\",%d", &_scanData->authType,
                         _scanData->ssidName, &_scanData->rssi);

    // Check for parsing. If 3 parameters have been found, parsing is successfull.
    if (_result != 3)
        return false;

    // Otherwise set current one SSID number as last used SSID number.
    *_lastUsedSsidNumber = _ssidNumber;

    // Return true as success.
    return true;
}

/**
 * @brief   Helper method used for parsing IP Addreses )local, gateway or subnet from the ESP32 message.
 *
 * @param   char *_ipAddressType
 *          Select IP data that will be parsed ("ip", "gateway" or "netmask").
 * @return  IPAddress
 *          Selected IP Address with the Arduino IPAddress Class.
 */
IPAddress WiFiClass::ipAddressParse(char *_ipAddressType)
{
    // Array for IP Address. For some reason, STM32 can't parse %hhu so int and %d must be used.
    int _ipAddress[4] = {0, 0, 0, 0};

    // String for filtering IP Adresses from the response.
    char _ipAddressTypeString[30];
    char _ipAddressTypeStringShort[20];
    sprintf(_ipAddressTypeString, "+CIPSTA:%s:\"%%d.%%d.%%d.%%d\"", _ipAddressType);
    sprintf(_ipAddressTypeStringShort, "+CIPSTA:%s:", _ipAddressType);

    // Send AT command and get the response. Check if the response is expected. Otherwise, return false.
    if (sendAtCommandWithResponse((char *)esp32AtWiFiGetIP, 200ULL, 4ULL, _ipAddressTypeStringShort,
                                  INKPLATE_ESP32_AT_EXPECTED_RESPONSE_ANY, true, NULL, 0, 0, NULL))
    {
        // Get the exact location of the response.
        char *_ipAddressStart = strstr(_dataBuffer, _ipAddressTypeStringShort);

        // Check one more time. If NULL, no match (no IP address found), return invalid IP address.
        if (_ipAddressStart == NULL)
            return INADDR_NONE;

        // Get the IP Address from the response.
        int _res = sscanf(_ipAddressStart, _ipAddressTypeString, &_ipAddress[0], &_ipAddress[1], &_ipAddress[2],
                          &_ipAddress[3]);

        // If can't find 4 bytes, return invalid IP Address.
        if (_res != 4)
            return INADDR_NONE;
    }

    // Return the IP Address.
    return IPAddress(_ipAddress[0], _ipAddress[1], _ipAddress[2], _ipAddress[3]);
}

// Decalre WiFi class to be globally available and visible.
WiFiClass WiFi;